module attributes {tf_saved_model.semantics, tfl.description = "MLIR Converted.", tfl.metadata = {CONVERSION_METADATA = "\0C\00\00\00\08\00\0E\00\08\00\04\00\08\00\00\00\10\00\00\00(\00\00\00\00\00\06\00\08\00\04\00\06\00\00\00\04\00\00\00\01\00\00\00\EB\03\00\00\0C\00\1C\00\18\00\14\00\10\00\04\00\0C\00\00\00\81\A3\99\BF\1E\F6\BD-\00\00\00\00\01\00\00\00\02\00\00\00\04\00\00\00\12\00\00\002.17.0-dev20240426\00\00", min_runtime_version = "2.9.0\00\00\00\00\00\00\00\00\00\00\00"}, tfl.schema_version = 3 : i32} {
  func.func @main(%arg0: tensor<?x16x24x!quant.uniform<i8:f32, 0.0039215688593685627:-128>> {tf_saved_model.index_path = ["args_0"]}) -> (tensor<?x256x!quant.uniform<i8:f32, 7.812500e-03>> {tf_saved_model.index_path = ["tokenizer"]}) attributes {tf.entry_function = {inputs = "serving_default_args_0:0", outputs = "StatefulPartitionedCall:0"}, tf_saved_model.exported_names = ["serving_default"]} {
    %0 = "tosa.const"() <{value = dense<"0x8080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808080808081818284888F9DB3D6002A4D6371787C7E7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F7F"> : tensor<256xi8>}> : () -> tensor<256x!quant.uniform<i8:f32, 1.000000e+00>>
    %1 = "tosa.const"() <{value = dense<"0x49FEFFFF92FDFFFF52010000F6070000A1FEFFFF20040000B70000001E0000002A000000430300002703000090FFFFFF990000006C02000061020000CAFFFFFFFFFEFFFF9E00000095FFFFFF79020000F7FDFFFF65000000630500009AFFFFFFB303000081FFFFFF660000003B000000F9FEFFFF63FFFFFF3E0100003A0200001D010000EF0300002D02000061FFFFFF33FFFFFF72000000690300001EFFFFFFE503000032FDFFFF2B000000C8000000FE030000BC0200005DFEFFFFE5000000FFFEFFFF29000000BDFEFFFF8F010000CE020000FF0A00004BFCFFFF1A000000BEFDFFFF8E00000047FDFFFF7F03000019010000C103000028FFFFFFD7010000FB05000070FFFFFF1F010000C4FEFFFFFD030000A5FCFFFF73010000FFF7FFFF20FFFFFF4D0000002E000000F2FDFFFF97FDFFFF4A00000015000000930400008702000099FCFFFFB5FFFFFFD4FAFFFF04060000A7FDFFFF4200000065FEFFFF41FEFFFFC8000000A0010000C6040000D3000000CCFEFFFF15FFFFFF860200000A020000ADFFFFFF12FEFFFF11FFFFFF980000002902000063FFFFFF2AFFFFFFA3FEFFFFD20000009DFCFFFF3E0000001C01000069FFFFFF98FDFFFFD30000006AFEFFFF87000000D40200001D0000006AFEFFFFA3FEFFFFC5010000E2FEFFFF3B020000F2FFFFFFE30000003C0300007DFDFFFFDFFAFFFF5A050000BA00000043000000670100005802000005010000E5FCFFFFC5FEFFFF9B040000B9FFFFFFB3FEFFFF2E0500003500000045FFFFFFD5FEFFFF5A010000E5FFFFFFCD0000004100000055FDFFFFA60200003B00000075FFFFFFFB050000C7FFFFFFF4030000F2040000100000007DFFFFFF18040000190500003B0000006601000062FDFFFF8201000071020000C40100009EFFFFFF69FEFFFF3CFDFFFFC703000027FEFFFFD8FDFFFFF100000086FEFFFF3301000033FEFFFF96FFFFFF4B0000006FFCFFFF7003000064FFFFFF94000000B8010000D8FEFFFFACFDFFFF9CFBFFFFB401000008FFFFFF7F000000AFFEFFFF2CFFFFFF65030000F1000000880300002F0200001D0000009EFEFFFFD900000000020000E201000052FFFFFFA001000022FFFFFF00FFFFFFDAFFFFFFB0FFFFFFAFFFFFFF9FFDFFFFC2FDFFFF6D000000A3FDFFFFCEFCFFFF3B0100003EFFFFFFD3000000600100005F0000002AFFFFFFA0FCFFFFB2FDFFFFD5010000170100007EFFFFFF850100008DFFFFFF9F0000008800000079010000C7FCFFFF1A0200000FFFFFFF920000007702000065010000AF000000F4FCFFFF840100008D0200006F0300000F040000F8FDFFFFB3FFFFFF4801000009020000E9FEFFFFD60200004800000029FFFFFF71FEFFFF0AFEFFFFB1000000EF0100001F0100000CFEFFFF410000004F010000F20100007BFFFFFF56FFFFFF"> : tensor<256xi32>}> : () -> tensor<256x!quant.uniform<i32:f32:0, {9.6217129612341523E-4,8.7897613411769271E-4,9.0994598576799035E-4,3.7540780613198876E-4,0.0014697209699079394,6.3433666946366429E-4,0.0015771271428093314,4.532628518063575E-4,0.0021701278164982796,8.2989636575803161E-4,4.1455018799751997E-4,0.0026311699766665697,0.001136849750764668,9.1189885279163718E-4,6.5990485018119216E-4,6.3154939562082291E-4,7.1493140421807766E-4,0.0013954968890175223,4.8241086187772453E-4,6.0854072216898203E-4,6.0545740416273475E-4,0.0014087213203310966,5.4991536308079958E-4,0.0011788801057264209,0.0012458229903131723,8.1273174146190286E-4,0.0010319077409803867,4.0779326809570193E-4,0.0016929141711443663,5.9435085859149694E-4,0.0012614981969818473,9.3774183187633753E-4,0.0014008398866280913,7.1580847725272179E-4,5.1429745508357882E-4,3.8572269841097295E-4,0.0016918422188609838,0.0010387864895164967,0.0010022580390796065,9.0030755382031202E-4,4.9224559916183352E-4,5.4153322707861662E-4,0.0020441198721528053,0.0018425765447318554,4.8077726387418807E-4,7.3135347338393331E-4,8.5096608381718397E-4,0.0010562529787421227,5.4469361202791333E-4,5.201637395657599E-4,5.5963516933843493E-4,7.5255875708535314E-4,4.3773706420324743E-4,3.7269972381182015E-4,9.3993038171902299E-4,0.0019517338369041681,4.5447744196280837E-4,9.220261126756668E-4,6.1155145522207022E-4,7.6741317752748728E-4,0.001662628841586411,0.0011620796285569668,0.0010124347172677517,0.001873878063634038,6.4583017956465483E-4,6.138624157756567E-4,4.3712678598240018E-4,0.0011280850740149617,4.8696112935431302E-4,4.2838326771743596E-4,8.4471737500280142E-4,3.6544652539305389E-4,0.0013943205121904612,5.0708593335002661E-4,5.5405579041689634E-4,0.0010355297708883882,0.0010469709523022175,5.7676271535456181E-4,0.0016924812225624919,5.0114188343286514E-4,7.3818268720060587E-4,3.5253763780929148E-4,0.0016247391467913985,4.766917263623327E-4,3.4912093542516232E-4,6.3602352747693658E-4,6.7301397211849689E-4,8.4607169264927506E-4,4.9370439955964684E-4,0.0011840362567454576,0.0016946637770161033,4.6048208605498075E-4,0.0025748265907168388,0.0015864882152527571,4.9970974214375019E-4,4.2598051368258893E-4,0.0013448933605104685,0.0016516158357262611,8.4859482012689113E-4,4.2179893353022635E-4,0.0013564352411776781,4.7763116890564561E-4,0.0011135544627904892,6.4273300813511014E-4,9.1075990349054337E-4,0.0016154138138517737,0.0017631060909479856,0.001328214886598289,8.1396067980676889E-4,6.2042864738032222E-4,4.000950139015913E-4,0.0011155622778460383,7.5685384217649698E-4,5.4585887119174004E-4,4.8245463403873146E-4,0.0025336220860481262,6.80855184327811E-4,7.6055043609812856E-4,4.1490144212730229E-4,3.6584545159712434E-4,0.0012152643175795674,0.0010569721926003695,5.7367852423340082E-4,6.2961416551843286E-4,6.6941435215994716E-4,5.5287056602537632E-4,3.7618447095155716E-4,0.0011319031473249197,9.1997097479179502E-4,9.5700006932020187E-4,5.3293438395485282E-4,0.0017082387348636985,3.951256803702563E-4,6.5614108461886644E-4,6.4136815490201116E-4,0.0012470795772969723,4.9069186206907034E-4,4.1648169280961156E-4,0.0017209534998983145,9.2841882724314928E-4,0.0019382978789508343,4.8245346988551319E-4,0.0010233670473098755,5.9388141380622983E-4,9.5259037334471941E-4,7.1951659629121423E-4,4.6270331949926913E-4,0.0021598695311695337,7.6239503687247634E-4,3.4450631937943399E-4,0.0011416870402172208,7.0259434869512916E-4,3.9488496258854866E-4,3.5964380367659032E-4,4.958739154972136E-4,6.5710465423762798E-4,6.3075724756345153E-4,0.0015183913055807352,3.9179489249363542E-4,6.3937494996935129E-4,7.8084436245262623E-4,4.3244415428489447E-4,5.2743632113561034E-4,0.00189917569514364,4.9645197577774525E-4,8.1683904863893985E-4,8.6861348245292902E-4,7.3630781844258308E-4,0.0015806338051334023,0.0018410426564514637,0.0013666152954101563,0.0017791837453842163,9.3484815442934632E-4,6.7566934740170836E-4,0.0020494603086262941,6.8557052873075008E-4,5.856407224200666E-4,4.6275890781544149E-4,0.0010284532327204943,5.9612112818285823E-4,0.0015624773222953081,6.8761216243728995E-4,4.316807899158448E-4,0.0012136857258155942,7.9542177263647318E-4,0.0012576949084177613,0.0014415002660825849,5.0669891061261296E-4,3.8108584703877568E-4,0.001707237446680665,0.0010235498193651438,8.9464994380250573E-4,7.0836592931300402E-4,5.3375243442133069E-4,0.0013263694709166884,0.0011680772295221686,0.0011788454139605165,0.0015163958305492997,0.0012489946093410254,7.5087969889864326E-4,5.442893598228693E-4,5.6845461949706078E-4,5.2482815226539969E-4,0.0014473125338554382,5.9113750467076898E-4,0.0013510789722204208,8.93344113137573E-4,0.0011140896240249276,3.4081147168762982E-4,0.0010668098693713546,5.076788947917521E-4,5.2850233623757958E-4,0.0010214014910161495,6.9667591014876962E-4,8.0469017848372459E-4,4.8687480739317834E-4,8.4444560343399644E-4,0.0011178752174600959,0.001017529284581542,4.2973092058673501E-4,8.7091384921222925E-4,0.0015705435071140528,0.0015357468510046601,7.313435198739171E-4,6.9472560426220298E-4,0.0015627093380317092,0.0014852597378194332,3.8920147926546633E-4,0.0019413296831771731,4.6061514876782894E-4,5.3642934653908014E-4,4.8424318083561957E-4,6.4484594622626901E-4,0.0024193592835217714,4.6555002336390316E-4,4.8875011270865798E-4,3.0544694163836539E-4,0.0012478608405217528,8.1424601376056671E-4,8.8780361693352461E-4,8.5713900625705718E-4,5.9512048028409481E-4,9.1290107229724526E-4,8.1218057312071323E-4,0.0013104616664350033,7.8033324098214507E-4,0.0011167697375640273,8.2447758177295327E-4,3.8872211007401347E-4,4.4627278111875057E-4,5.2565702935680747E-4,8.2029448822140694E-4,0.0010894809383898973,7.3332764441147447E-4,0.0020638974383473396,4.7606756561435759E-4}>>
    %2 = "tosa.const"() <{value = 